// String regex = r'[^\p{Alphabetic}\p{Mark}\p{Decimal_Number}\p{Connector_Punctuation}\p{Join_Control}\s]+';
const String regex = r'[^\p{Decimal_Number}\s]+';
List<List<String>>kinds=[
  ['شحن رصيد ','دقائق لكل الشبكات','فليكسات'],
  ['شحن رصيد ','وحدات لكل الشبكات','ميجابايتس'],
  ['شحن رصيد','ميكسات','دقائق','ميجابايتس','نت سوشيال','نت فيديو'],
  ['شحن رصيد','انترنت فقط','وحدات فقط'],
];

List<List<String>>kindCodes=[
  ['*858*كود الشحن#','*858*1*كود الشحن#','*858*2*كود الشحن#'],
  ['#102*كود الشحن#','#102*1*كود الشحن#','#102*2*كود الشحن##'],
  ['*556*كود الشحن#','*556*1*كود الشحن#','*556*2*كود الشحن#','*556*3*كود الشحن#','*556*5*كود الشحن#','*556*7*كود الشحن#'],
  ['*555*كود الشحن#','*599*كود الشحن#','*566*كود الشحن#'],
];
